from rsa.rsa import RSA

if __name__ == '__main__':
    p = 1003636526287921
    q = 630114564355681
    e = 227175758417350578804323023499
    X1 = 94380455332205669620317800575
    Y2 = 493089842126272405947077785493

    rsa = RSA(p, q, e)
    print(f'Исходное сообщение X1: {X1}')
    Y1 = rsa.encrypt(X1)
    print(f'Зашифрованное сообщение Y1: {Y1}')
    X1_dec = rsa.decrypt(Y1)
    print(f'После расшифровки: {X1_dec}')

    print(f'Зашифрованное сообщение Y2: {Y2}')
    X2_dec = rsa.decrypt(Y2)
    print(f'После расшифровки: {X2_dec}')
